# UBC
## Programming in Python for DS

January 23, 2023

Instructor: Socorro Dominguez Vidana

In [1]:

import pandas as pd

### Module 2

Overview:

- [] Show how to use `.loc` and `.iloc`
- [] Demonstrate how to rename columns of a dataframe using .rename()
- [] Create new or columns in a dataframe using .assign() notation.
- [] Drop columns in a dataframe using .drop()
- [] Use df[] notation to filter rows of a dataframe.
- [] Calculate summary statistics on grouped objects using .groupby() and .agg().

In [2]:
data = {'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.],
                  'Min Speed': [120., 110., 5., 6.]}
data

{'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'],
 'Max Speed': [380.0, 370.0, 24.0, 26.0],
 'Min Speed': [120.0, 110.0, 5.0, 6.0]}

In [3]:
type(data)

dict

In [4]:
df = pd.DataFrame(data)
df

   Animal  Max Speed  Min Speed
0  Falcon      380.0      120.0
1  Falcon      370.0      110.0
2  Parrot       24.0        5.0
3  Parrot       26.0        6.0

In [5]:
df

   Animal  Max Speed  Min Speed
0  Falcon      380.0      120.0
1  Falcon      370.0      110.0
2  Parrot       24.0        5.0
3  Parrot       26.0        6.0

In [6]:
pd.DataFrame(df)

   Animal  Max Speed  Min Speed
0  Falcon      380.0      120.0
1  Falcon      370.0      110.0
2  Parrot       24.0        5.0
3  Parrot       26.0        6.0

In [7]:
df.describe()

        Max Speed   Min Speed
count    4.000000    4.000000
mean   200.000000   60.250000
std    202.115479   63.352848
min     24.000000    5.000000
25%     25.500000    5.750000
50%    198.000000   58.000000
75%    372.500000  112.500000
max    380.000000  120.000000

## `.loc`

Select rows and columns based on `label`

The rule:

`df.loc[:, start:end:step]` or `df.loc[:, [labels]]`

In [8]:
df.loc[:, 'Animal':'Max Speed']

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [9]:
df.loc[:, ['Animal', 'Min Speed']]

   Animal  Min Speed
0  Falcon      120.0
1  Falcon      110.0
2  Parrot        5.0
3  Parrot        6.0

In [10]:
df.loc[2, ['Animal', 'Min Speed']]

Animal       Parrot
Min Speed       5.0
Name: 2, dtype: object

In [11]:
df.loc[0, 'Animal']

'Falcon'

#### `.iloc`

Same as `loc` but works with index rather than label.

In [12]:
df.iloc[0, 0]

'Falcon'

In [13]:
df.iloc[:,1]

0    380.0
1    370.0
2     24.0
3     26.0
Name: Max Speed, dtype: float64

In [14]:
df.loc[:, 'Max Speed']

0    380.0
1    370.0
2     24.0
3     26.0
Name: Max Speed, dtype: float64

#### `assign()`

with `.loc[]`

In [15]:
df.assign(speedx2 = df.loc[:, 'Max Speed']*2)

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

Keep in mind you are not saving anything here - yet.

In [16]:
df

   Animal  Max Speed  Min Speed
0  Falcon      380.0      120.0
1  Falcon      370.0      110.0
2  Parrot       24.0        5.0
3  Parrot       26.0        6.0

In [17]:
df  = df.assign(speedx2 = df.loc[:, 'Max Speed']*2)
df

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

In [18]:
df

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

without `.loc[]`

In [19]:
df.assign(speedx2 = df['Max Speed']*2)
df.assign(speedx2 = df.loc[:, 'Max Speed']*2)

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

In [20]:
df

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

without `.assign()`

In [21]:
df['new_col3'] = df['Max Speed']*2

In [22]:
df

   Animal  Max Speed  Min Speed  speedx2  new_col3
0  Falcon      380.0      120.0    760.0     760.0
1  Falcon      370.0      110.0    740.0     740.0
2  Parrot       24.0        5.0     48.0      48.0
3  Parrot       26.0        6.0     52.0      52.0

In [23]:
df['new_col3']

0    760.0
1    740.0
2     48.0
3     52.0
Name: new_col3, dtype: float64

#### `.drop()`

In [24]:
df.drop(columns = 'Max Speed')

   Animal  Min Speed  speedx2  new_col3
0  Falcon      120.0    760.0     760.0
1  Falcon      110.0    740.0     740.0
2  Parrot        5.0     48.0      48.0
3  Parrot        6.0     52.0      52.0

In [25]:
df

   Animal  Max Speed  Min Speed  speedx2  new_col3
0  Falcon      380.0      120.0    760.0     760.0
1  Falcon      370.0      110.0    740.0     740.0
2  Parrot       24.0        5.0     48.0      48.0
3  Parrot       26.0        6.0     52.0      52.0

In [26]:
df.drop(columns = ['Animal', 'Max Speed'])

   Min Speed  speedx2  new_col3
0      120.0    760.0     760.0
1      110.0    740.0     740.0
2        5.0     48.0      48.0
3        6.0     52.0      52.0

In [27]:
df

   Animal  Max Speed  Min Speed  speedx2  new_col3
0  Falcon      380.0      120.0    760.0     760.0
1  Falcon      370.0      110.0    740.0     740.0
2  Parrot       24.0        5.0     48.0      48.0
3  Parrot       26.0        6.0     52.0      52.0

In [28]:
df = df.drop(columns = 'new_col3')

In [29]:
df

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

In [30]:
df.rename(columns = {'Max Speed':'max_speed', 
                     'new_col':'speedx2'})

   Animal  max_speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

In [31]:
df

   Animal  Max Speed  Min Speed  speedx2
0  Falcon      380.0      120.0    760.0
1  Falcon      370.0      110.0    740.0
2  Parrot       24.0        5.0     48.0
3  Parrot       26.0        6.0     52.0

In [32]:
df.shape

(4, 4)

In [33]:
df.columns = ['_animal', '_max_speed', '_min_speed', '_speed2']

In [34]:
df

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       380.0       120.0    760.0
1  Falcon       370.0       110.0    740.0
2  Parrot        24.0         5.0     48.0
3  Parrot        26.0         6.0     52.0

#### `filter`

In [35]:
df

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       380.0       120.0    760.0
1  Falcon       370.0       110.0    740.0
2  Parrot        24.0         5.0     48.0
3  Parrot        26.0         6.0     52.0

In [36]:
df['_max_speed'] > 300

0     True
1     True
2    False
3    False
Name: _max_speed, dtype: bool

In [37]:
df[df['_max_speed'] > 300]

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       380.0       120.0    760.0
1  Falcon       370.0       110.0    740.0

```python
df[(_____) & (_____)]
```

In [38]:
df[(df['_max_speed'] > 320) & (df['_max_speed'] < 380)]

  _animal  _max_speed  _min_speed  _speed2
1  Falcon       370.0       110.0    740.0

#### `.groupby()`

In [39]:
df

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       380.0       120.0    760.0
1  Falcon       370.0       110.0    740.0
2  Parrot        24.0         5.0     48.0
3  Parrot        26.0         6.0     52.0

In [40]:
df.groupby('_animal')

**What does that even mean??**

![](https://media1.giphy.com/media/FcuiZUneg1YRAu1lH2/giphy.gif?cid=ecf05e47t6tl4ppzchujy27worbrevfetpm299tixcfm7sk6&rid=giphy.gif&ct=g)

![img](https://miro.medium.com/max/1206/0*5Zzcwe-rlxz-EQ_N)

In [41]:
df[df['_animal'] == 'Falcon']

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       380.0       120.0    760.0
1  Falcon       370.0       110.0    740.0

In [42]:
df2 = df.groupby('_animal').sum()
df2

         _max_speed  _min_speed  _speed2
_animal
Falcon        750.0       230.0   1500.0
Parrot         50.0        11.0    100.0

`reset_index()`

In [43]:
df.groupby('_animal').sum()

         _max_speed  _min_speed  _speed2
_animal
Falcon        750.0       230.0   1500.0
Parrot         50.0        11.0    100.0

In [44]:
df.groupby('_animal').sum().reset_index()

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       750.0       230.0   1500.0
1  Parrot        50.0        11.0    100.0

In [45]:
df.groupby('_animal', as_index=False).sum()

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       750.0       230.0   1500.0
1  Parrot        50.0        11.0    100.0

In [46]:
df2.columns

Index(['_max_speed', '_min_speed', '_speed2'], dtype='object')

In [47]:
df2 = df2.reset_index()
df2

  _animal  _max_speed  _min_speed  _speed2
0  Falcon       750.0       230.0   1500.0
1  Parrot        50.0        11.0    100.0

In [48]:
df3 = df.groupby('_animal').agg({'_max_speed':['mean', 'sum']})
df3

        _max_speed
              mean    sum
_animal
Falcon       375.0  750.0
Parrot        25.0   50.0

In [49]:
df3.reset_index()

  _animal _max_speed
                mean    sum
0  Falcon      375.0  750.0
1  Parrot       25.0   50.0

In [50]:
df3[df3['_max_speed', 'mean'] > 300]

        _max_speed
              mean    sum
_animal
Falcon       375.0  750.0

In [51]:
df.groupby('_animal').agg(['mean', 'sum']).loc[:,'_max_speed'].reset_index()

  _animal   mean    sum
0  Falcon  375.0  750.0
1  Parrot   25.0   50.0

Is there only **ONE** way of doing things?

![](https://media2.giphy.com/media/ftqLysT45BJMagKFuk/giphy.gif?cid=ecf05e47zx1vugxxgh9hyet02mwendrr6tfopa20ysvst7pi&rid=giphy.gif&ct=g)

**The tests are a guide.**

We cannot make very strict tests. 
- Inhibit your creativity. 

We cannot make very lenient tests.
- Cannot test your output

Tests are based on:
- An ideal of best practices
- Tidy data (more on this next week)
- A bit of hand holding to make your life in future questions "easier"
- Beginner friendly skills (if you are a pro, you might find them quite limiting)

**Disclaimer:**
If you want the full mark, you need to pass the test.

How?

| NO | YES |
| --- | --- |
| ![](https://media3.giphy.com/media/9bXjoBk28pwnKLKoKb/giphy.gif?cid=ecf05e476d0x3f361cv2upqr8x6p1whtx5ggazdhrsoigmf0&rid=giphy.gif&ct=g) | ![](https://media4.giphy.com/media/anSiSGG5YaXeBn5gv4/giphy.gif?cid=ecf05e476d0x3f361cv2upqr8x6p1whtx5ggazdhrsoigmf0&rid=giphy.gif&ct=g)|

Read the bottom part of the error messages, you might find them helpful.


#### Summary

##### What we did?

- [x] Show how to use `.loc` and `.iloc`
- [x] Demonstrate how to rename columns of a dataframe using .rename()
- [x] Create new or columns in a dataframe using .assign() notation.
- [x] Drop columns in a dataframe using .drop()
- [x] Use df[] notation to filter rows of a dataframe.
- [x] Calculate summary statistics on grouped objects using .groupby() and .agg().

##### Extra (time allowing)

How to change labels based on multiple conditions for different columns (Age in Titanic)

In [52]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [53]:
import numpy as np

conditions = [
    ((df['Animal'] == 'Falcon') & (df['Max Speed'] < 350)),
    ((df['Animal'] == 'Falcon') & (df['Max Speed'] >= 350)),
    ((df['Animal'] == 'Parrot') & (df['Max Speed'] <= 300)),
    ((df['Animal'] == 'Parrot') & (df['Max Speed'] > 300))
    ]

# create a list of the values we want to assign for each condition
values = ['slow_falcon', 'fast_falcon', 'avg_parrot', 'vfast_parrot']

# create a new column and use np.select to assign values to it using our lists as arguments
df['class'] = np.select(conditions, values)

df

   Animal  Max Speed        class
0  Falcon      380.0  fast_falcon
1  Falcon      370.0  fast_falcon
2  Parrot       24.0   avg_parrot
3  Parrot       26.0   avg_parrot

In [54]:
df.loc[(df['Animal']=="Falcon")&(df['Max Speed']>375), "class"] = "super falcon"

In [55]:
df

   Animal  Max Speed         class
0  Falcon      380.0  super falcon
1  Falcon      370.0   fast_falcon
2  Parrot       24.0    avg_parrot
3  Parrot       26.0    avg_parrot